Информационная_база/src/InformationRegisters/УпоминанияВКоментарияхДокумента/УпоминанияВКоментарияхДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УпоминанияВКоментарияхДокумента</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>СтатусДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаДокумент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СообщенияДляУведоления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВремяОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолучательИзмерение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусИзменерение</name>
    <type>
      <types>EnumRef.СтатусДокумента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Информационная_база/src/CommonModules/СерверКогоПинганулиВКоментахВызовСервера/Module.bsl
//@skip-check module-region-empty
#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти
//@skip-check module-region-empty
#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура  ПинганутьПлучателя(ПараметрыПроцедуры) Экспорт
	
	НоваяЗапись = РегистрыСведений.УпоминанияВКоментарияхДокумента.СоздатьМенеджерЗаписи();
	НоваяЗапись.ВремяОтправления = ТекущаяДата();
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.СтатусДоставки = Ложь;
	НоваяЗапись.Отправитель = ПараметрыПроцедуры[1];
	НоваяЗапись.Получатель = ПараметрыПроцедуры[2];
	НоваяЗапись.СсылкаНаДокумент = ПараметрыПроцедуры[3];
	НоваяЗапись.НомерДокумента = ПараметрыПроцедуры[0]; 
	НоваяЗапись.Записать();	
	
	
КонецПроцедуры

#КонецОбласти
